podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/MCG_MK82F25615.svd.xml
            <register>
               <name>C8</name>
               <description>Control 8 Register</description>
               <addressOffset>0xD</addressOffset>
               <size>8</size>
               <resetValue>0x80</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>LOCS1</name>
                     <description>RTC Loss of Clock Status\n
This bit indicates when a loss of clock has occurred\n
Cleared by writing a logic 1 to it when set</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>RTC loss has not occurred</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>RTC loss has occurred</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CME1</name>
                     <description>RTC Clock Monitor Enable1\n
Enables the loss of clock monitoring circuit for the output of the RTC external reference clock</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock monitor disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock monitor is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOLRE</name>
                     <description>PLL Loss of Lock Reset Enable\n
Determines if an interrupt or a reset request is made following a PLL loss of lock</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset request</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="LOLRE" > <name>LOCRE1</name> <description>Loss of Clock Reset Enable\n
Determines if a interrupt or a reset request is made following a loss of RTC external reference clock</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
         </registers>
      </peripheral>
